#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "libusb.h"
// document available at http://libusb.sourceforge.net/api-1.0/modules.html

//to be compiled with : make -f Makefile.OSX all


#if defined(__APPLE__)
#define SLEEP(n) system("sleep " #n) //osx
#elif defined(__linux__)
#define SLEEP(n) system("sleep " #n) //osx
#else // aka windows :)
#include "windows.h"
#define SLEEP(n) Sleep(1000*n) //windows
#endif


/* the device's vendor and product id */
#define XMOS_VID 0x20b1

#define XMOS_XCORE_AUDIO_AUDIO2_PID 0x3066
#define XMOS_DXIO                   0x2009
#define XMOS_L1_AUDIO2_PID          0x0002
#define XMOS_L1_AUDIO1_PID          0x0003
#define XMOS_L2_AUDIO2_PID          0x0004
#define XMOS_SU1_AUDIO2_PID         0x0008
#define XMOS_U8_MFA_AUDIO2_PID      0x000A

unsigned short pidList[] = {XMOS_XCORE_AUDIO_AUDIO2_PID, 
						    XMOS_DXIO,
                            XMOS_L1_AUDIO2_PID,
                            XMOS_L1_AUDIO1_PID,
                            XMOS_L2_AUDIO2_PID,
                            XMOS_SU1_AUDIO2_PID, 
                            XMOS_U8_MFA_AUDIO2_PID}; 



#define DFU_REQUEST_TO_DEV      0x21
#define DFU_REQUEST_FROM_DEV    0xa1

#define VENDOR_REQUEST_TO_DEV    (LIBUSB_ENDPOINT_OUT | LIBUSB_REQUEST_TYPE_VENDOR | LIBUSB_RECIPIENT_DEVICE)
#define VENDOR_REQUEST_FROM_DEV  (LIBUSB_ENDPOINT_IN  | LIBUSB_REQUEST_TYPE_VENDOR | LIBUSB_RECIPIENT_DEVICE)


  printf("... loading opcodes (%s) to device (%dbytes)\n", file, bin_size);

  blockCount = 0;

  for (i = 0; i < num_blocks; i++) {
    memset(block_data, 0x0, block_size);
    fread(block_data, 1, block_size, inFile);
    result = vendor_dsp_load_page(blockCount, block_size, block_data);
    if (0) {
            fprintf(stderr,"Error: dsp_load_page returned an error %d\n",result);
           return -1; }
    blockCount++;
    if ((blockCount & 63) == 0)
        printf("%dko\n", blockCount / 16);
  }

  result = vendor_dsp_load_page(0, 0, NULL);    // this is the formal command for ending the loading process
  if (0) {
          fprintf(stderr,"Error: dsp_load_page final step returned an error %d\n",result);
         return -1; }
   printf("... dsp load completed %d bytes\n",bin_size);

  return 0;
}

void getDacStatus(){
    unsigned char data[64];
    libusb_control_transfer(devh, VENDOR_REQUEST_FROM_DEV,
            VENDOR_GET_DEVICE_INFO, 0, 0, data, 64, 0);
    printf("DAC mode            = 0x%X\n", data[0]);
    printf("I2S Audio config    = 0x%2X (%d)\n", data[1], tableFreq[data[1] & 7]);
    printf("USB Audio config    = 0x%2X (%d)\n", data[2], tableFreq[data[2] & 7]);
    printf("DSP program number  = %d\n",    data[3]);
    printf("front panel version = %d\n",    data[4]);
    printf("Sound presence      = 0x%2X\n", data[5]);
    printf("trigger             = 0x%2X\n", data[6]);
    short vol= (signed char)data[7];
    if (vol>0)
        printf("usb volume          = muted (%ddB)\n", -vol-1 );
    else
        printf("usb volume          = %ddB\n", vol );
    vol= (signed char)data[8];
    if (vol>0)
        printf("front panel volume  = muted (%ddB)\n", -vol-1 );
    else
        printf("front panel volume  = %ddB\n", vol );
    printf("xmos BCD version    = 0x%4X\n", (data[9]+(data[10]<<8)) );
    printf("usb vendor ID       = 0x%4X\n", (data[11]+(data[12]<<8)) );
    printf("usb product ID      = 0x%4X\n", (data[13]+(data[14]<<8)) );
    printf("maximum frequency   = %d\n",    (data[15]+(data[16]<<8)+(data[17]<<16)+(data[18]<<24)) );
    printf("maximum dsp tasks   = %d\n",    (data[19]) );
    for (int i=0; i<= data[19]; i++)
        if (i != data[19])
             printf("dsp %d: instructions = %d\n", i+1, (data[20+i+i]+(data[20+i+i]<<8)) );
        else printf("maxi   instructions = %d\n", (data[20+i+i]+(data[20+i+i]<<8)) );
}

#define F28(x) ((double)(x)/(double)(1<<28))
#define F(x,y) ((double)(x)/(double)(1<<y))
void dspReadMem(int addr){
    unsigned data[16];
    unsigned char * p = (unsigned char*)&data[0];
    libusb_control_transfer(devh, VENDOR_REQUEST_FROM_DEV,
            VENDOR_READ_DSP_MEM, addr, 0, p, 64, 0);
    for (int i=0; i<16; i++) {
        int x = data[i];
        float f = (float)data[i];
        printf("0x%4X : %8X %d %f %f\n",i,x,x,F(x,24),f);
    }
}

static const int dspTableFreq[] = {
        8000, 16000,
        24000, 32000,
        44100, 48000,
        88200, 96000,
        176400,192000,
        352800,384000,
        705600, 768000 };

typedef struct dspHeader_s {    // 11 words
/* 0 */     int head;
/* 1 */     int   totalLength;  // the total length of the dsp program (in 32 bits words), rounded to upper 8bytes
/* 2 */     int   dataSize;     // required data space for executing the dsp program (in 32 bits words)
/* 3 */     unsigned checkSum;  // basic calculated value representing the sum of all opcodes used in the program
/* 4 */     int   numCores;     // number of cores/tasks declared in the dsp program
/* 5 */     int   version;      // version of the encoder used MAJOR, MINOR,BUGFIX
/* 6 */     unsigned short   format;       // contains DSP_MANT used by encoder or 1 for float or 2 for double
/*   */     unsigned short   maxOpcode;    // last op code number used in this program (to check compatibility with runtime)
/* 7 */     int   freqMin;      // minimum frequency possible for this program, in raw format eg 44100
/* 8 */     int   freqMax;      // maximum frequency possible for this program, in raw format eg 192000
/* 9 */     unsigned usedInputs;   //bit mapping of all used inputs
/* 10 */    unsigned usedOutputs;  //bit mapping of all used outputs
        } dspHeader_t;



void dspReadHeader(){
    dspHeader_t header;
    unsigned char * p = (unsigned char*)&header;
    libusb_control_transfer(devh, VENDOR_REQUEST_FROM_DEV,
            VENDOR_READ_DSP_MEM, 0, 0, p, sizeof(dspHeader_t), 0);
    printf("total length = %d\n",header.totalLength);
    if (header.totalLength) {
        printf("data size    = %d\n",header.dataSize);
        printf("checksum     = 0x%X\n",header.checkSum);
        printf("num cores    = %d\n",header.numCores);
        printf("version      = %X\n",header.version);
        if (header.format)
             printf("encoded int    %d.%d\n",(32-header.format),header.format);
        else printf("encoded float\n");
        printf("freq min     = %d (%d)\n",header.freqMin,dspTableFreq[header.freqMin]);
        printf("freq max     = %d (%d)\n",header.freqMax,dspTableFreq[header.freqMax]);
    }
}

int main(int argc, char **argv) {
  int r = 1;
